Repository: mikugirls/CastoriceLauncher
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# NavHome.Content
source: Home
zh_cn: 主页
zh_tw: 首頁

# NavSettings.Content
source: Settings
zh_cn: 设置
zh_tw: 設定

# NavTutorial.Content
source: Tutorial
zh_cn: 教程
zh_tw: 教學

# NavLogs.Content
source: Logs
zh_cn: 日志
zh_tw: 日誌

# HomeHeader.Text
source: Castorice Launcher
zh_cn: Castorice 启动器
zh_tw: Castorice 啟動器

# HomeTagline.Text
source: [ See you tomorrow. ]
zh_cn: [ 欢迎回来。 ]
zh_tw: [ 明天見。 ]

# HomeSubtitle.Text
source: Apply patch files, disable AccountPlatNative.dll, then start the game launcher as administrator.
zh_cn: 应用补丁、禁用 AccountPlatNative.dll，然后以管理员身份启动游戏 Launcher。
zh_tw: 套用補丁、停用 AccountPlatNative.dll，並以系統管理員身分啟動遊戲 Launcher。

# HomeGamePathLabel.Text
source: Game executable
zh_cn: 游戏可执行文件
zh_tw: 遊戲可執行檔

# HomePatchPathLabel.Text
source: Patch folder
zh_cn: 补丁目录
zh_tw: 補丁目錄

# HomeStatusLabel.Text
source: Status
zh_cn: 状态
zh_tw: 狀態

# HomeOpenSettings.Content
source: Open settings
zh_cn: 打开设置
zh_tw: 開啟設定

# HomeStartButton.Content
source: Start game
zh_cn: 开始游戏
zh_tw: 開始遊戲

# AnnouncementHeader.Text
source: Announcements
zh_cn: 公告
zh_tw: 公告

# AnnouncementRefresh.Content
source: Refresh
zh_cn: 刷新
zh_tw: 重新整理

# AnnouncementDefaultTitle
source: Welcome back
zh_cn: 欢迎回来
zh_tw: 歡迎回來

# AnnouncementDefaultBody
source: Set your announcement URL in Settings to show server news here.
zh_cn: 在设置里填写公告地址后，这里会显示服务器公告。
zh_tw: 在設定中填入公告網址後，這裡會顯示伺服器公告。

# AnnouncementDefaultMeta
source: Waiting for updates
zh_cn: 等待更新
zh_tw: 等待更新

# AnnouncementLoading
source: Loading...
zh_cn: 加载中...
zh_tw: 載入中...

# AnnouncementLoaded
source: Updated just now
zh_cn: 刚刚更新
zh_tw: 剛剛更新

# AnnouncementErrorFormat
source: Failed to load: {0}
zh_cn: 加载失败：{0}
zh_tw: 載入失敗：{0}

# LinksHeader.Text
source: Links
zh_cn: 链接
zh_tw: 連結

# LinkTools.Content
source: SR Tools
zh_cn: SR 工具
zh_tw: SR 工具

# ServerHeader.Text
source: Server
zh_cn: 服务器
zh_tw: 伺服器

# ServerExeLabel.Text
source: Server executable
zh_cn: 服务器程序
zh_tw: 伺服器程式

# ServerStatusLabel.Text
source: Status
zh_cn: 状态
zh_tw: 狀態

# ServerLogLabel.Text
source: Logs
zh_cn: 日志
zh_tw: 日誌

# ServerStart.Content
source: Start server
zh_cn: 启动服务器
zh_tw: 啟動伺服器

# ServerStop.Content
source: Stop server
zh_cn: 停止服务器
zh_tw: 停止伺服器

# ServerRepair.Content
source: Repair server
zh_cn: 修复服务器
zh_tw: 修復伺服器

# ServerStopped
source: Stopped
zh_cn: 未运行
zh_tw: 未執行

# ServerRunningFormat
source: Running (PID {0})
zh_cn: 运行中（PID {0}）
zh_tw: 執行中（PID {0}）

# ServerExeMissing
source: Server executable not set or missing.
zh_cn: 服务器程序未设置或不存在。
zh_tw: 伺服器程式未設定或不存在。

# ServerStartingFormat
source: Starting server: {0}
zh_cn: 正在启动服务器：{0}
zh_tw: 正在啟動伺服器：{0}

# ServerStartFailedFormat
source: Failed to start server: {0}
zh_cn: 启动服务器失败：{0}
zh_tw: 啟動伺服器失敗：{0}

# ServerStopFailedFormat
source: Failed to stop server: {0}
zh_cn: 停止服务器失败：{0}
zh_tw: 停止伺服器失敗：{0}

# ServerStoppedByUser
source: Server stopped.
zh_cn: 服务器已停止。
zh_tw: 伺服器已停止。

# ServerExitedFormat
source: Server exited (code {0}).
zh_cn: 服务器已退出（代码 {0}）。
zh_tw: 伺服器已結束（代碼 {0}）。

# ServerRestoredFromCacheFormat
source: Server restored from cache: {0}
zh_cn: 已从缓存恢复服务器：{0}
zh_tw: 已從快取還原伺服器：{0}

# ServerRepairingFormat
source: Repairing server using {0}
zh_cn: 使用缓存包修复服务器：{0}
zh_tw: 正在使用快取套件修復伺服器：{0}

# ServerRepairSucceeded
source: Server repaired.
zh_cn: 服务器修复完成。
zh_tw: 伺服器修復完成。

# ServerRepairFailedFormat
source: Repair failed: {0}
zh_cn: 修复失败：{0}
zh_tw: 修復失敗：{0}

# ServerRepairNoPackage
source: No cached package found to repair.
zh_cn: 未找到可用于修复的缓存包。
zh_tw: 找不到可用的快取套件來修復。

# SettingsHeader.Text
source: Setup
zh_cn: 设置
zh_tw: 設定

# SettingsGameExe.Header
source: Game executable (Launcher.exe is in the same folder)
zh_cn: 游戏可执行文件（Launcher.exe 与其在同一目录）
zh_tw: 遊戲可執行檔（Launcher.exe 與其在同一目錄）

# SettingsBrowseGameExe.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# SettingsPatchDir.Header
source: Patch folder
zh_cn: 补丁目录
zh_tw: 補丁目錄

# SettingsBrowsePatchDir.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# SettingsServerExe.Header
source: Server executable (CastoricePS.exe)
zh_cn: 服务器程序（CastoricePS.exe）
zh_tw: 伺服器程式（CastoricePS.exe）

# SettingsBrowseServerExe.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# SettingsBackground.Header
source: Home background image
zh_cn: 主页背景图
zh_tw: 首頁背景圖

# SettingsBrowseBackground.Content
source: Browse...
zh_cn: 浏览...
zh_tw: 瀏覽...

# SettingsNoticeUrl.Header
source: Announcement URL
zh_cn: 公告地址
zh_tw: 公告網址

# SettingsSave.Content
source: Save
zh_cn: 保存
zh_tw: 儲存

# SettingsLanguage.Header
source: Language
zh_cn: 语言
zh_tw: 語言

# LanguageEnglish.Content
source: English
zh_cn: 英语
zh_tw: 英文

# LanguageSimplified.Content
source: Simplified Chinese
zh_cn: 简体中文
zh_tw: 簡體中文

# LanguageTraditional.Content
source: Traditional Chinese
zh_cn: 繁體中文
zh_tw: 繁體中文

# TutorialHeader.Text
source: Tutorial
zh_cn: 教程
zh_tw: 教學

# TutorialBody.Text
source: 1. In Settings, choose the game Launcher.exe. 2. Choose the patch folder (the folder that contains patch files). 3. Return to Home and click Start. The launcher will copy patch files and start Launcher.exe as administrator.
zh_cn: 1. 在设置里选择游戏 Launcher.exe。 2. 选择补丁目录（包含补丁文件的文件夹）。 3. 回到主页点击开始。程序会复制补丁并以管理员身份启动 Launcher.exe。
zh_tw: 1. 在設定中選擇遊戲 Launcher.exe。 2. 選擇補丁目錄（包含補丁檔案的資料夾）。 3. 回到首頁點擊開始。程式會複製補丁並以系統管理員身分啟動 Launcher.exe。

# LogsHeader.Text
source: Logs
zh_cn: 日志
zh_tw: 日誌

# LogsCopy.Content
source: Copy
zh_cn: 一键复制
zh_tw: 一鍵複製

# LogsExport.Content
source: Export logs.txt
zh_cn: 导出 logs.txt
zh_tw: 匯出 logs.txt

# LogsClear.Content
source: Clear
zh_cn: 清空
zh_tw: 清空

# LogsCopied
source: Copied to clipboard.
zh_cn: 已复制到剪贴板。
zh_tw: 已複製到剪貼簿。

# LogsCleared
source: Cleared.
zh_cn: 已清空。
zh_tw: 已清空。

# LogsExportCanceled
source: Export canceled.
zh_cn: 已取消导出。
zh_tw: 已取消匯出。

# LogsExportedFormat
source: Exported: {0}
zh_cn: 已导出：{0}
zh_tw: 已匯出：{0}

# LogsCopyFailedFormat
source: Copy failed: {0}
zh_cn: 复制失败：{0}
zh_tw: 複製失敗：{0}

# LogsExportFailedFormat
source: Export failed: {0}
zh_cn: 导出失败：{0}
zh_tw: 匯出失敗：{0}

# NotSetPlaceholder
source: (not set)
zh_cn: （未设置）
zh_tw: （未設定）

# StatusIdle
source: Idle
zh_cn: 空闲
zh_tw: 閒置

# StatusSettingsSaved
source: Settings saved.
zh_cn: 设置已保存。
zh_tw: 設定已儲存。

# StatusCopyingPatch
source: Copying patch files...
zh_cn: 正在复制补丁文件...
zh_tw: 正在複製補丁檔案...

# StatusRenamingPlugin
source: Renaming AccountPlatNative.dll...
zh_cn: 正在重命名 AccountPlatNative.dll...
zh_tw: 正在重新命名 AccountPlatNative.dll...

# StatusPluginRenameFailedFormat
source: Failed to rename AccountPlatNative.dll: {0}
zh_cn: 重命名 AccountPlatNative.dll 失败：{0}
zh_tw: 重新命名 AccountPlatNative.dll 失敗：{0}

# StatusGameExeMissing
source: Game executable not set or missing.
zh_cn: 游戏可执行文件未设置或不存在。
zh_tw: 遊戲可執行檔未設定或不存在。

# StatusPatchMissing
source: Patch folder not set or missing.
zh_cn: 补丁目录未设置或不存在。
zh_tw: 補丁目錄未設定或不存在。

# StatusGameDirInvalid
source: Game directory is invalid.
zh_cn: 游戏目录无效。
zh_tw: 遊戲目錄無效。

# StatusLauncherNotFound
source: Launcher.exe not found after patch copy.
zh_cn: 复制补丁后未找到 Launcher.exe。
zh_tw: 複製補丁後找不到 Launcher.exe。

# StatusLauncherAlreadyRunning
source: Launcher already running.
zh_cn: Launcher 已在运行。
zh_tw: Launcher 已在執行中。

# StatusLaunchCanceledFormat
source: Launch canceled: {0}
zh_cn: 启动已取消：{0}
zh_tw: 啟動已取消：{0}

# StatusLauncherFailed
source: Launcher failed to start.
zh_cn: Launcher 启动失败。
zh_tw: Launcher 啟動失敗。

# StatusLaunchSuccess
source: Patch applied. Launcher started as administrator.
zh_cn: 补丁已应用，已以管理员身份启动 Launcher。
zh_tw: 補丁已套用，已以系統管理員身分啟動 Launcher。

source: Unknown error
zh_cn: 未知错误
zh_tw: 未知錯誤

# UpdateHeader.Text
source: Updates
zh_cn: 更新
zh_tw: 更新

# LauncherUpdateHeader.Text
source: Launcher update
zh_cn: 启动器更新
zh_tw: 啟動器更新

# LauncherUpdateLocalVersionLabel.Text
source: Local
zh_cn: 本地版本
zh_tw: 本機版本

# LauncherUpdateLatestVersionLabel.Text
source: Latest
zh_cn: 最新版本
zh_tw: 最新版本

# LauncherUpdateNotesLabel.Text
source: Notes
zh_cn: 更新说明
zh_tw: 更新說明

# LauncherUpdateStatusLabel.Text
source: Status
zh_cn: 更新状态
zh_tw: 更新狀態

# LauncherUpdateInstall.Content
source: Update launcher
zh_cn: 更新启动器
zh_tw: 更新啟動器

# UpdateLocalVersionLabel.Text
source: Local
zh_cn: 本地版本
zh_tw: 本機版本

# UpdateLatestVersionLabel.Text
source: Latest
zh_cn: 最新版本
zh_tw: 最新版本

# UpdateNotesLabel.Text
source: Notes
zh_cn: 更新说明
zh_tw: 更新說明

# UpdateStatusLabel.Text
source: Update status
zh_cn: 更新状态
zh_tw: 更新狀態

# UpdateUsingCacheFormat
source: Using cached package: {0}
zh_cn: 使用缓存更新包：{0}
zh_tw: 使用快取套件：{0}

# UpdateCheck.Content
source: Check
zh_cn: 检查更新
zh_tw: 檢查更新

# UpdateInstall.Content
source: Update
zh_cn: 安装更新
zh_tw: 安裝更新

# SettingsUpdateUrl.Header
source: Update manifest URL
zh_cn: 更新清单地址（manifest）
zh_tw: 更新清單網址（manifest）

# UpdateVersionUnknown
source: (unknown)
zh_cn: （未知）
zh_tw: （未知）

# UpdateNotInstalled
source: (not installed)
zh_cn: （未安装）
zh_tw: （未安裝）

# UpdateCacheLatest
source: Latest
zh_cn: 最近下载
zh_tw: 最近下載

# UpdateNotChecked
source: Not checked
zh_cn: 未检查
zh_tw: 未檢查

# UpdateNotesNotAvailable
source: (no notes)
zh_cn: （无说明）
zh_tw: （無說明）

# UpdateChecking
source: Checking...
zh_cn: 正在检查...
zh_tw: 正在檢查...

# UpdateDownloading
source: Downloading update...
zh_cn: 正在下载更新...
zh_tw: 正在下載更新...

# UpdateExtracting
source: Extracting...
zh_cn: 正在解压...
zh_tw: 正在解壓縮...

# UpdateVerifying
source: Verifying package...
zh_cn: 正在校验...
zh_tw: 正在驗證...

# UpdateInstalling
source: Installing...
zh_cn: 正在安装...
zh_tw: 正在安裝...

source: Update installed.
zh_cn: 更新已安装。
zh_tw: 更新已安裝。

source: Update URL not set.
zh_cn: 未设置更新地址。
zh_tw: 未設定更新網址。

# UpdateUpToDate
source: Up to date.
zh_cn: 已是最新。
zh_tw: 已是最新。

source: Update available.
zh_cn: 有可用更新。
zh_tw: 有可用更新。

# UpdateCheckFailedFormat
source: Update check failed: {0}
zh_cn: 检查更新失败：{0}
zh_tw: 檢查更新失敗：{0}

# UpdateInvalidUrlFormat
source: Invalid update URL: {0}
zh_cn: 更新地址无效：{0}
zh_tw: 更新網址無效：{0}

# UpdateInstallFailedFormat
source: Install failed: {0}
zh_cn: 安装失败：{0}
zh_tw: 安裝失敗：{0}

# UpdateNoPackage
source: No update package in manifest.
zh_cn: 清单里没有更新包。
zh_tw: 清單中沒有更新包。

# UpdateServerPathMissing
source: Server executable not set.
zh_cn: 未设置服务器程序路径。
zh_tw: 未設定伺服器程式路徑。

# UpdateServerDirInvalid
source: Server directory is invalid.
zh_cn: 服务器目录无效。
zh_tw: 伺服器目錄無效。

# UpdateSizeMismatchFormat
source: Size mismatch (got {0}, expected {1}).
zh_cn: 文件大小不匹配（得到 {0}，期望 {1}）。
zh_tw: 檔案大小不符（得到 {0}，預期 {1}）。

# UpdateHashMismatchFormat
source: SHA256 mismatch (got {0}).
zh_cn: SHA256 不匹配（得到 {0}）。
zh_tw: SHA256 不符（得到 {0}）。

# UpdateDownloadPathLabel.Text
source: Download to
zh_cn: 下载到
zh_tw: 下載到

# UpdateProgressUnknownTotalFormat
source: {0} downloaded
zh_cn: 已下载 {0}
zh_tw: 已下載 {0}

# UiStatusReady
source: Ready.
zh_cn: 就绪。
zh_tw: 就緒。

# UiStartTitleReady
source: Start Game
zh_cn: 启动游戏
zh_tw: 啟動遊戲

# UiStartTitleNeedPath
source: Set Path & Start
zh_cn: 设置路径并启动
zh_tw: 設定路徑並啟動

# UiStartSubReady
source: Auto Start Server + Launcher
zh_cn: 自动拉起服务端与启动器
zh_tw: 自動啟動伺服器與啟動器

# UiStartSubNeedPath
source: Pick Game Directory
zh_cn: 选择游戏目录
zh_tw: 選擇遊戲目錄

# UiStatusPickGameCanceled
source: No game directory selected.
zh_cn: 未选择游戏目录。
zh_tw: 未選擇遊戲目錄。

# UiStatusHomeReady
source: Home is ready. Click Start Game to launch.
zh_cn: 主页已就绪，点击“启动游戏”即可开始。
zh_tw: 首頁已就緒，點擊「啟動遊戲」即可開始。

# UiTopHome
source: Home
zh_cn: 主页
zh_tw: 首頁

# UiTopTools
source: Tools
zh_cn: 工具
zh_tw: 工具

# UiTopPlugins
source: Plugins
zh_cn: 插件
zh_tw: 外掛

# UiTopHowTo
source: How to?
zh_cn: 使用说明
zh_tw: 使用說明

# UiTopAbout
source: About
zh_cn: 关于
zh_tw: 關於

# UiPluginsNotEnabled
source: Plugin system is not enabled in this build.
zh_cn: 当前版本未启用插件系统。
zh_tw: 目前版本未啟用外掛系統。

# UiHowToBody
source: 1. Select the game directory in Settings. 2. Click Start Game. 3. The launcher starts Server automatically and copies launcher.exe only when missing.
zh_cn: 1. 在设置中选择游戏目录。 2. 点击“启动游戏”。 3. 启动器会自动拉起服务端，并仅在缺少 launcher.exe 时进行复制。
zh_tw: 1. 在設定中選擇遊戲目錄。 2. 點擊「啟動遊戲」。 3. 啟動器會自動啟動伺服器，並僅在缺少 launcher.exe 時進行複製。

# UiVersionUnknown
source: unknown
zh_cn: 未知
zh_tw: 未知

# UiAboutBodyFormat
source: Castorice Launcher Version: {0} Local Mode
zh_cn: Castorice 启动器 版本：{0} 本地模式
zh_tw: Castorice 啟動器 版本：{0} 本機模式

# UiOpenPatchOkFormat
source: Opened patch directory: {0}
zh_cn: 已打开补丁目录：{0}
zh_tw: 已開啟補丁目錄：{0}

# UiOpenPatchFailFormat
source: Failed to open patch directory: {0}
zh_cn: 打开补丁目录失败：{0}
zh_tw: 開啟補丁目錄失敗：{0}

# UiStatusCurrentGameDirFormat
source: Current game directory: {0}
zh_cn: 当前游戏目录：{0}
zh_tw: 目前遊戲目錄：{0}

# UiStatusGameDirNotSet
source: Game directory is not set yet.
zh_cn: 当前未设置游戏目录。
zh_tw: 尚未設定遊戲目錄。

# UiStatusGameDirSetFormat
source: Game directory set: {0}
zh_cn: 已设置游戏目录：{0}
zh_tw: 已設定遊戲目錄：{0}

# UiPatchDirMissingFormat
source: Patch directory is missing: {0}
zh_cn: 补丁目录不存在：{0}
zh_tw: 補丁目錄不存在：{0}

# UiGameDirInvalid
source: Invalid game directory. Please reconfigure it.
zh_cn: 游戏目录无效，请重新设置。
zh_tw: 遊戲目錄無效，請重新設定。

# UiLauncherEnsureFailed
source: launcher.exe is missing and auto-copy failed.
zh_cn: 未找到 launcher.exe，且自动复制失败。
zh_tw: 找不到 launcher.exe，且自動複製失敗。

# UiLauncherStartedFormat
source: Started: {0}
zh_cn: 已启动：{0}
zh_tw: 已啟動：{0}

# UiServerAlreadyRunningFormat
source: Server already running: {0} ({1})
zh_cn: 服务器已在运行：{0}（{1}）
zh_tw: 伺服器已在執行：{0}（{1}）

# UiServerDirMissingFormat
source: Server directory is missing: {0}
zh_cn: 服务器目录不存在：{0}
zh_tw: 伺服器目錄不存在：{0}

# UiServerExeMissingInDirFormat
source: No executable found in server directory: {0}
zh_cn: 服务器目录中未找到可执行文件：{0}
zh_tw: 伺服器目錄中找不到可執行檔：{0}

# UiServerStartFailedFormat
source: Failed to start server: {0}
zh_cn: 服务器启动失败：{0}
zh_tw: 伺服器啟動失敗：{0}

# UiServerStartedFormat
source: Server started: {0}
zh_cn: 服务器已启动：{0}
zh_tw: 伺服器已啟動：{0}

# UiLauncherExistsSkipCopy
source: launcher.exe already exists. Skipping copy.
zh_cn: 游戏目录已存在 launcher.exe，跳过复制。
zh_tw: 遊戲目錄已存在 launcher.exe，略過複製。

# UiCopyLauncherToGame
source: Copying launcher.exe to game directory...
zh_cn: 正在复制 launcher.exe 到游戏目录...
zh_tw: 正在複製 launcher.exe 到遊戲目錄...

# UiOpenUrlOkFormat
source: Opened: {0}
zh_cn: 已打开：{0}
zh_tw: 已開啟：{0}

# UiOpenUrlFailFormat
source: Failed to open: {0}
zh_cn: 打开失败：{0}
zh_tw: 開啟失敗：{0}

# UiPathNotSet
source: Path: Not Set
zh_cn: 路径：未设置
zh_tw: 路徑：未設定

# UiPathValueFormat
source: Path: {0}
zh_cn: 路径：{0}
zh_tw: 路徑：{0}

# UiPickGameDir
source: Select Game Directory
zh_cn: 选择游戏目录
zh_tw: 選擇遊戲目錄

# UiGameDirLabel
source: Game Directory
zh_cn: 游戏目录
zh_tw: 遊戲目錄

# UiLanguageLabel
source: Language
zh_cn: 语言
zh_tw: 語言

# UiSettingsTitle
source: Settings
zh_cn: 设置
zh_tw: 設定

# UiSave
source: Save
zh_cn: 保存
zh_tw: 儲存

# UiCancel
source: Cancel
zh_cn: 取消
zh_tw: 取消

# UiSettingsSaved
source: Settings saved.
zh_cn: 设置已保存。
zh_tw: 設定已儲存。

# UiOpenPatchDir
source: Open Patch Directory
zh_cn: 打开补丁目录
zh_tw: 開啟補丁目錄

# UiOpenServerDir
source: Open Server Directory
zh_cn: 打开服务端目录
zh_tw: 開啟伺服器目錄

# UiClose
source: Close
zh_cn: 关闭
zh_tw: 關閉

# UiTipSettings
source: Settings
zh_cn: 设置
zh_tw: 設定

# UiTipPatch
source: Patch Directory
zh_cn: 补丁目录
zh_tw: 補丁目錄

# UiTipStatus
source: Status
zh_cn: 状态
zh_tw: 狀態

# UiLeftTools
source: Tools
zh_cn: 工具
zh_tw: 工具

# UiLeftDiscord
source: Discord
zh_cn: 社群
zh_tw: 社群

# UiWelcome
source: Welcome
zh_cn: 欢迎
zh_tw: 歡迎

# UiAboutLinksTitle
source: References:
zh_cn: 参考项目：
zh_tw: 參考專案：

# UiPluginApplyLanguagePatch
source: Apply Language Patch
zh_cn: 应用语言补丁
zh_tw: 套用語言補丁

# UiPluginApplyHdiff
source: Apply HDiff Patch
zh_cn: 应用 HDiff 补丁
zh_tw: 套用 HDiff 補丁

# UiPluginLanguageSectionTitle
source: Built-in Plugin: Language Patcher
zh_cn: 内置插件：语言补丁器
zh_tw: 內建插件：語言補丁器

# UiPluginTextLanguageLabel
source: Text Language
zh_cn: 文本语言
zh_tw: 文字語言

# UiPluginVoiceLanguageLabel
source: Voice Language
zh_cn: 语音语言
zh_tw: 語音語言

# UiPluginHdiffSectionTitle
source: Built-in Plugin: HDiff Apply
zh_cn: 内置插件：HDiff 应用器
zh_tw: 內建插件：HDiff 套用器

# UiPluginHdiffDescription
source: Apply hdiff/hdifffiles patch data in game directory.
zh_cn: 在游戏目录中应用 hdiff/hdifffiles 补丁数据。
zh_tw: 在遊戲目錄中套用 hdiff/hdifffiles 補丁資料。

# UiPluginLanguageEntryMissing
source: AllowedLanguage entry not found in DesignV.
zh_cn: 在 DesignV 中未找到 AllowedLanguage 条目。
zh_tw: 在 DesignV 中找不到 AllowedLanguage 項目。

# UiPluginLanguagePatchOkFormat
source: Language patch applied: text={0}, voice={1}
zh_cn: 语言补丁已应用：文本={0}，语音={1}
zh_tw: 語言補丁已套用：文字={0}，語音={1}

# UiPluginLanguagePatchFailedFormat
source: Language patch failed: {0}
zh_cn: 语言补丁失败：{0}
zh_tw: 語言補丁失敗：{0}

# UiPluginNoDiffEntries
source: No diff entries found.
zh_cn: 未找到可用的差分条目。
zh_tw: 找不到可用的差分項目。

# UiPluginHdiffCompleted
source: HDiff patch completed.
zh_cn: HDiff 补丁应用完成。
zh_tw: HDiff 補丁套用完成。

# UiPluginHdiffFailedFormat
source: HDiff patch failed: {0}
zh_cn: HDiff 补丁失败：{0}
zh_tw: HDiff 補丁失敗：{0}

# UiUpdatePatchServerFromZip
source: Update Patch/Server from ZIP
zh_cn: 从 ZIP 更新补丁/服务端
zh_tw: 從 ZIP 更新補丁/伺服器

# UiUpdateFromZipCanceled
source: ZIP selection canceled.
zh_cn: 已取消选择 ZIP 文件。
zh_tw: 已取消選擇 ZIP 檔案。

# UiUpdateFromZipApplyingFormat
source: Applying update from ZIP: {0}
zh_cn: 正在从 ZIP 更新：{0}
zh_tw: 正在從 ZIP 更新：{0}

# UiUpdateFromZipNoPatchServer
source: No Patch/Server content found in ZIP.
zh_cn: ZIP 中未找到 Patch/Server 内容。
zh_tw: ZIP 中找不到 Patch/Server 內容。

# UiUpdateFromZipDone
source: Patch/Server updated from ZIP.
zh_cn: 已从 ZIP 更新 Patch/Server。
zh_tw: 已從 ZIP 更新 Patch/Server。

# UiUpdateFromZipFailedFormat
source: ZIP update failed: {0}
zh_cn: ZIP 更新失败：{0}
zh_tw: ZIP 更新失敗：{0}
